class Menu(object):

    def __init__(self):
        self.__choice = None
        self.__answer = None

    @staticmethod
    def main_display() -> None:
        print("------------------------------------------------\n"
              "|  Система управления туристическим агенством  |\n"
              "------------------------------------------------\n"
              "|         1. Показать все предложения.         |\n"
              "|         2. Выборка по странам.               |\n"
              "|         3. Выборка по цене.                  |\n"
              "|         4. Выборка по длительности.          |\n"
              "|         5. Поиск по названию.                |\n"
              "|         6. Окно управления.                  |\n"
              "|         0. Выйти из программы.               |\n"
              "------------------------------------------------")

    @staticmethod
    def mange_display():
        print("------------------------------------------------\n"
              "|  Система управления туристическим агенством  |\n"
              "------------------------------------------------\n"
              "|         1. Создать предложение.              |\n"
              "|         2. Добавить страну.                  |\n"
              "|         3. Удалить предложение.              |\n"
              "|         4. Удалить страну.                   |\n"
              "|         5. Изменить предложение.             |\n"
              "|         6. Вернуться назад.                  |\n"
              "|         0. Выйти из программы.               |\n"
              "------------------------------------------------")

    def allow_continue(self) -> bool:
        self.__answer = input('Продолжать (y/n)? - ')
        return self.__answer == 'y' or self.__answer == 'Y'

    def get_choice(self) -> int:
        try:
            self.__choice = int(input('Выберете нужное действие: '))
        except ValueError:
            print('Неправильный формат вводы!')
        return self.__choice
